#include <stdio.h>

int main(void)
{
	int a[2][5] = {{1, 2, 3, 4, 5}, {6, 7, 8, 9, 10}};
	/*
	int (*p1)[5] = a;		//a有2个一维元素，a作为右值表示首元素的首地址，也就是&a[0]
	int (*p1)[5] = &a[0];		//&a[0]表示第一维元素的首地址，第一维元素包含5个元素：1，2，3，4，5
	printf("a[0][2] = %d.\n", *(*(p1 + 0) + 2));		//这里的0是第一维的，相当于第0个元素，该元素有5个值：1， 2， 3， 4， 5，   2是第二维度的，相当于第0个元素中的第2个值：3
	printf("a[1][0] = %d.\n", *(*(p1 + 1) + 0));
	
	p1 = &a[1];
	printf("a[1][4] = %d.\n", *(*(p1 + 0) + 4));
	printf("a[2][1] = %d.\n", *(*(p1 + 1) + 1));
	printf("a[2][1] = %d.\n", a[2][1]);
	
	//指针指向二维数组的第一维
	int *p2 = a[0];		//a【0】作为右值表示第一维元素的首元素（1）的首地址，也就是&a[0][0];
	int *p3 = &a[0][0];
	
	printf("*(p2 + 3) = %d.\n", *(p2 + 3));
	printf("*(p3 + 3) = %d.\n", *(p3 + 3));
	*/
	
	//指针指向二维数组的第一维
	int *p4 = a[1];		//a【0】作为右值表示第一维元素的首元素（1）的首地址，也就是&a[0][0];
	int *p5 = &a[1][0];
	
	printf("*(p4 + 3) = %d.\n", *(p4 + 3));
	printf("*(p5 + 3) = %d.\n", *(p5 + 3));
	
	return 0;
}