/*
* 公司：中软国际有限公司
* 作者：周建伟
* 项目：C语言隐式类型转换
* 目的：初步了解隐式类型转换
*/
#include <stdio.h>

//C语言隐式转换理念：隐式类型转换向精度更高、范围更大的方向转换。
int main(void)
{
	int a = 5;
	float b = 6.4;
	int c = 0;
	float d = 0;
	
	printf("a + b = %f.\n", a + b);		//a + b 由于类型不一致，会发生隐式转换，隐式转换原则是向精度更高、范围更大的方向转换。于是int类型的a隐式转换为float类型的临时变量f1 = 5.000000，与float类型的b相加，打印时以float类型格式打印，于是结果为11.400000.
	//printf("a + b = %d.\n", a + b);		//会报错，因为以int类型格式去打印float类型的数
	c = a + b;
	printf("c = %d.\n", c);		//a + b 由于类型不一致，会将int类型的a隐式转换为精度更高的float类型的临时变量f1=5.000000,与float类型的b=6.4相加，等于11.400000.
								//但由于赋值时应以左值的类型为准，所以float类型的临时变量f2转换为int类型的临时变量i=11，赋值给c,所以c=11.
	d = a + b;
	printf("d = %f\n", d);
	
	return 0;
}